quizzes1/app/views/leaderboard/_leaderboard.html.erb

	<% top_results.each do |hash| %>
		<% username = User.find(hash[:user_id].to_i).username %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1