quizzes1/app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`question`, `ans1`, `ans2`, `ans3`, `ans4`, `ans5`, `ans6`, `correct`, `quiz_id`) VALUES ('When did WWI start?', '1941 BC', '1941 AC', '573 AC', '2039 AC', '', '', 2, 1)

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE `questions` SET `ans5` = '', `ans6` = '' WHERE `questions`.`question_id` = 1

  def destroy
    @question.destroy
---
DELETE FROM `questions` WHERE `questions`.`question_id` = 1

    def set_question
      @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`question_id` = 1 LIMIT 1