quizzes1/app/controllers/quizzes_controller.rb

  def create
    @quiz = current_user.quizzes.build(quiz_params)

    points_to_award = 0
    @quiz.questions.each { points_to_award += 1 }
    current_user.add_points(points_to_award * 3, category: 'Create')

    respond_to do |format|
      if @quiz.save
---
INSERT INTO `questions` (`question`, `quiz_id`) VALUES ('What color is the sky?', 4)
INSERT INTO `quizzes` (`name`, `shuffled`, `user_id`) VALUES ('GIMMEBADGE', 0, 1)