quizzes1/app/controllers/scores_controller.rb

  def create
    num_questions = params[:answer].length
    num_correct = 0

    0.upto(num_questions - 1) do |question_index|
      answered_correctly = params[:answer][question_index.to_s] == params[:correct][question_index.to_s]
      num_correct += 1 if answered_correctly
    end

    score = num_correct / num_questions.to_f * 100 # convert to percentage

    # code smell
    @score = Score.new(score: score.to_i, quiz_id: params[:quiz_id], user_id: params[:user_id])

    respond_to do |format|
      if @score.save
---
INSERT INTO `scores` (`score`, `quiz_id`, `user_id`, `created_at`, `updated_at`) VALUES (66, 1, -1, '2015-03-03 19:47:07.387681', '2015-03-03 19:47:07.387681')

    def set_score
      @score = Score.find(params[:id])
---
SELECT  `scores`.* FROM `scores` WHERE `scores`.`score_id` = 6 LIMIT 1