quizzes1/app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@quizzes = @user.quizzes.all
  	@scores = @user.scores.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `quizzes`.* FROM `quizzes` WHERE `quizzes`.`quiz_id` = 1 LIMIT 1
SELECT `scores`.* FROM `scores` WHERE `scores`.`user_id` = 1

	def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1