quizzes1/app/views/quizzes/edit.html.erb


<% @quiz.question.all.each do |question| %>
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`quiz_id` = 1